; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	spectrograph0 - mode
	image1 - mode
	infrared2 - mode
	image3 - mode
	Star9 - direction
	GroundStation11 - direction
	GroundStation13 - direction
	Star1 - direction
	GroundStation0 - direction
	Star7 - direction
	GroundStation3 - direction
	GroundStation10 - direction
	GroundStation4 - direction
	Star14 - direction
	GroundStation6 - direction
	GroundStation5 - direction
	GroundStation8 - direction
	Star2 - direction
	Star12 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Planet19 - direction
	Phenomenon20 - direction
	Phenomenon21 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet19)
	(supports instrument1 spectrograph0)
	(supports instrument1 image3)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation8)
	(supports instrument2 infrared2)
	(supports instrument2 image3)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon17)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star14)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 Star14)
	(calibration_target instrument4 GroundStation5)
	(supports instrument5 image1)
	(calibration_target instrument5 Star12)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
)
(:goal (and
	(pointing satellite0 GroundStation11)
	(pointing satellite2 GroundStation4)
	(have_image Planet15 image3)
	(have_image Star16 spectrograph0)
	(have_image Phenomenon17 spectrograph0)
	(have_image Star18 image1)
	(have_image Planet19 image1)
	(have_image Phenomenon20 spectrograph0)
	(have_image Phenomenon21 infrared2)
))

)

; plan
1. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 9
2. (calibrate satellite2 instrument5 groundstation8)
   added: (calibrated instrument5)
   goals met: 0 of 9
3. (turn_to satellite2 star18 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 star18)
   goals met: 0 of 9
4. (take_image satellite2 star18 instrument5 image1)
   added: (have_image star18 image1)
   goals met: 1 of 9
5. (turn_to satellite2 planet19 star18)
   deleted: (pointing satellite2 star18)
   added: (pointing satellite2 planet19)
   goals met: 1 of 9
6. (turn_to satellite1 groundstation10 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 groundstation10)
   goals met: 1 of 9
7. (turn_to satellite0 groundstation11 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 groundstation11)
   goals met: 2 of 9
8. (take_image satellite2 planet19 instrument5 image1)
   added: (have_image planet19 image1)
   goals met: 3 of 9
9. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 3 of 9
10. (calibrate satellite1 instrument2 groundstation10)
   added: (calibrated instrument2)
   goals met: 3 of 9
11. (turn_to satellite1 phenomenon17 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 phenomenon17)
   goals met: 3 of 9
12. (take_image satellite1 phenomenon17 instrument2 spectrograph0)
   added: (have_image phenomenon17 spectrograph0)
   goals met: 4 of 9
13. (turn_to satellite1 phenomenon20 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon20)
   goals met: 4 of 9
14. (take_image satellite1 phenomenon20 instrument2 spectrograph0)
   added: (have_image phenomenon20 spectrograph0)
   goals met: 5 of 9
15. (turn_to satellite1 phenomenon21 phenomenon20)
   deleted: (pointing satellite1 phenomenon20)
   added: (pointing satellite1 phenomenon21)
   goals met: 5 of 9
16. (take_image satellite1 phenomenon21 instrument2 infrared2)
   added: (have_image phenomenon21 infrared2)
   goals met: 6 of 9
17. (turn_to satellite1 planet15 phenomenon21)
   deleted: (pointing satellite1 phenomenon21)
   added: (pointing satellite1 planet15)
   goals met: 6 of 9
18. (take_image satellite1 planet15 instrument2 image3)
   added: (have_image planet15 image3)
   goals met: 7 of 9
19. (turn_to satellite1 star16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star16)
   goals met: 7 of 9
20. (take_image satellite1 star16 instrument2 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 8 of 9
21. (turn_to satellite2 groundstation4 planet19)
   deleted: (pointing satellite2 planet19)
   added: (pointing satellite2 groundstation4)
   goals met: 9 of 9
